tap 'caskroom/cask'

# Core Homebrew
cask 'java'
brew 'git'
brew 'sqlite3'
brew 'mysql', restart_service: true
brew 'crystal-lang'
brew 'curl'
brew 'maven'
brew 'gradle'
brew 'node'
brew 'vim'
brew 'wget'
brew 'npm'
brew 'python3'
brew 'python'
brew 'docker'
brew 'heroku'
brew 'htop'
brew 'mongodb'
brew 'redis'


# Cask Apps
cask 'google-chrome'
cask 'robo-3t'
cask 'docker-toolbox'
cask 'sequel-pro'
cask 'filezilla'
cask 'spotify'
cask 'hyper'
cask 'postman'
cask 'eclipse-java'
cask 'google-drive'
cask 'sqlitebrowser'
cask 'microsoft-office'

# Mac app store
mas 'GIPHY CAPTURE', id: 668208984
mas 'The Unarchiver', id: 425424353
mas 'BetterSnapTool', id: 417375580
mas 'Battery Monitor', id: 836505650
